
** TODO hdparm
https://bbs.archlinux.org/viewtopic.php?id=220946
https://wiki.archlinux.org/title/Hdparm


#+begin_src bash :results verbatim
ls /dev/disk/by-id/
#+end_src

try to umount and turn off usb hdd's
#+header: :dir /sudo::
#+begin_src bash :results verbatim
# /usr/bin/hdparm -f -F -Y /dev/disk/by-id/usb-sobetter_EXT_552708094-0:0
# /usr/bin/hdparm -f -F -Y /dev/disk/by-id/usb-TOSHIBA_External_USB_3.0_2012062540488-0:0
udisksctl unmount -b /dev/
udisksctl power-off -b /dev/
#+end_src

list only usb drives

source: https://linuxopsys.com/topics/list-usb-devices-in-linux?utm_content=cmp-true
#+begin_src bash :results verbatim
# df -Th | awk '/media/{print $0}'
ls -l /dev/disk/by-id | grep usb
# ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'
#+end_src

#+RESULTS:

#+begin_src bash :results verbatim
echo "$(basename $(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'))"
#+end_src

#+RESULTS:
: sdd

try 1
#+begin_src bash :results verbatim
# disks="$(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$')"
for usb_disk in $(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'); do
  echo "/dev/$(basename ${usb_disk})"
  # udisksctl unmount -b "/dev/$(basename ${usb_disk})"
  # udisksctl power-off -b "/dev/$(basename ${usb_disk})"
done
#+end_src

#+RESULTS:
: /dev/sdd
: /dev/sde

#+RESULTS:
: /dev/sdd
: /dev/sdd1
: /dev/sdd2
: /dev/sdd3
: /dev/sde
: /dev/sde1

#+begin_src bash :results verbatim
for usb_disk in $(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'); do
  echo "/dev/$(basename ${usb_disk})"
  # udisksctl unmount -b "/dev/$(basename ${usb_disk})"
  # umount "/dev/$(basename ${usb_disk})"
  # udisksctl power-off -b "/dev/$(basename ${usb_disk})"
done
# mount
#+end_src

#+RESULTS:
: /dev/sdd
: /dev/sde

#+begin_src bash :results verbatim
# sudo nano /usr/lib/systemd/system-shutdown/hdparm.shutdown
# sudo chmod a+x /usr/lib/systemd/system-shutdown/hdparm.shutdown
if [ "$1" = "poweroff" ]; then
  /usr/bin/hdparm -f -F -Y /dev/disk/by-id/ata-WDC_WD40EFRX-...
fi
#+end_src

#+begin_src bash :results verbatim
cat /usr/lib/systemd/system-shutdown/hdparm.shutdown
#+end_src

#+RESULTS:
: #!/bin/sh
: # We need to ensure all md arrays with external metadata
: # (e.g. IMSM, DDF) are clean before completing the shutdown.
: /sbin/mdadm --wait-clean --scan

*** worked

#+header: :dir /sudo::

#+header: :tangle /tmp/usb_hdd.shutdown
#+header: :shebang #!/bin/bash
#+begin_src bash :results verbatim
usb_disks () {
  usb_disks=$(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$')
}
if usb_disks; then
  for usb_disk in "${usb_disks[@]}"; do
    echo "usb hdd identifyed: /dev/$(basename ${usb_disk})"
    echo "usb hdd identifyed: /dev/$(basename ${usb_disk})"
    # for usb_disk_partition in /dev/$(basename ${usb_disk})*; do
    #   if mount | grep -q "${usb_disk_partition}"; then
    # 	 echo "unmounting drive ${usb_disk_partition}"
    # 	 # umount "${usb_disk_partition}"
    #   fi
    # done
    echo "powering off drive /dev/$(basename ${usb_disk})"
    # /usr/bin/hdparm -f -F -Y "/dev/$(basename ${usb_disk})"
    # udisksctl power-off -b "/dev/$(basename ${usb_disk})"
    # sleep 5
  done
fi
#+end_src

#+RESULTS:
: usb hdd identifyed: /dev/
: powering off drive /dev/


#+header: :tangle /sudo::/usr/lib/systemd/system-shutdown/usb_hdd.shutdown
#+header: :shebang #!/bin/bash
#+header: :dir /sudo::
#+begin_src bash :results verbatim
if [[ "$1" = "poweroff" ]]; then
  usb_disks(){
      ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'
  }
  for usb_disk in $(usb_disks); do
    # echo "/dev/$(basename ${usb_disk})"
    for usb_disk_partition in /dev/"$(basename ${usb_disk})"[0-9]*; do
      echo "${usb_disk_partition}"
      if mount | grep -q "${usb_disk_partition}"; then  
	echo "umount ${usb_disk_partition}"
	# umount "${usb_disk_partition}"
      fi
    done
    # udisksctl power-off -b "/dev/$(basename ${usb_disk})"
    # /usr/bin/hdparm -f -F -Y "/dev/$(basename ${usb_disk})"
    echo "/usr/bin/hdparm -f -F -Y /dev/$(basename ${usb_disk})"
  done
fi
#+end_src

#+RESULTS:
#+begin_example
/dev/sdd1
umount /dev/sdd1
/dev/sdd2
umount /dev/sdd2
/dev/sdd3
umount /dev/sdd3
/usr/bin/hdparm -f -F -Y /dev/sdd
/dev/sde1
umount /dev/sde1
/usr/bin/hdparm -f -F -Y /dev/sde
#+end_example

#+header: :dir /sudo::
#+begin_src bash :results verbatim
for usb_disk in $(ls -l /dev/disk/by-id | awk '/usb/{print $11}' | grep '[^0-9]$'); do
  echo "/dev/$(basename ${usb_disk})"
  # for usb_disk_partition in /dev/$(basename ${usb_disk})*; do
  #   echo "${usb_disk_partition}"
  #   if mount | grep -q "${usb_disk_partition}"; then  
  #     umount "${usb_disk_partition}"
  #   fi
  # done
  ## hdparm
  # -I: display information of the hard drive
  # -f: Flush buffer cache for device on exit
  # -F: Flush drive write cache
  # -Y: interrupt low power consumption to shut down it completely 
  # /usr/bin/hdparm -f -F -Y "/dev/$(basename ${usb_disk})"
  /usr/bin/hdparm -I "/dev/$(basename ${usb_disk})"
done
#+end_src
  [2023-02-15 Wed]
  [[file:~/Projects/][file:~/Projects/]]

** TODO set the default search engine for Firefox without the GUI on Linux?

https://superuser.com/questions/1682794/how-can-i-set-the-default-search-engine-for-firefox-without-the-gui-on-linux

#+begin_src bash :results verbatim
cat ~/.mozilla/firefox/*.default/times.json
#+end_src

#+RESULTS:
: {
: "created": 1677870321708,
: "firstUse": null
: }

policies.json 
#+begin_src java
{
  "policies": {
    "SearchEngines": {
      "Default": "NAME_OF_SEARCH_ENGINE"
    }
  }
}
#+end_src

** TODO archlinux fan speed control

WORKED:

https://aur.archlinux.org/packages/mcontrolcenter-bin

monitor cpu temperature
#+begin_example bash
watch cat /sys/devices/system/cpu/cpu[0-3]*/cpufreq/scaling_cur_freq
#+end_example


NOT WORKED:

[[https://wiki.archlinux.org/title/Fan_speed_control]]

set sensors, just run this command and answer YES to all

#+begin_src bash :results verbatim
sensors-detect
#+end_src

check the detected sensors

#+begin_src bash :results verbatim
sensors
#+end_src

#+RESULTS:
#+begin_example
coretemp-isa-0000
Adapter: ISA adapter
Package id 0:  +64.0°C  (high = +84.0°C, crit = +100.0°C)
Core 0:        +64.0°C  (high = +84.0°C, crit = +100.0°C)
Core 1:        +61.0°C  (high = +84.0°C, crit = +100.0°C)

acpitz-acpi-0
Adapter: ACPI interface
temp1:        +27.8°C  (crit = +105.0°C)
temp2:        +29.8°C  (crit = +105.0°C)
temp3:        +64.0°C  (crit = +100.0°C)

#+end_example

the fan RPM do not appeared, so we need to Increase the fan divisor for sensors [[https://wiki.archlinux.org/title/Fan_speed_control#Increase_the_fan_divisor_for_sensors][url]]

(WARNING: CODE NOT COMPLETE)
#+begin_src bash :results verbatim
chipset_name=$(sensors | head -n1)
echo "chip \"${chipset_name}\"
set fan"
#+end_src

#+RESULTS:
: coretemp-isa-0000
  [2023-05-03 mié]
** TODO pacman expac

show package optional dependencies
#+begin_src bash :results verbatim
expac -Ss '%D' obs-studio
#+end_src

#+RESULTS:
: ffmpeg  jansson  libxinerama  libxkbcommon-x11  mbedtls  rnnoise  pciutils  qt6-svg  curl  jack  gtk-update-icon-cache  pipewire  libxcomposite

#+begin_src bash :results verbatim
pacman -Ss hevc
#+end_src

#+RESULTS:
: extra/x265 3.5-3 [installed]
:     Open Source H265/HEVC video encoder
: community/hm 17.0-1
:     HEVC Test Model - the reference software for HEVC
: community/kvazaar 2.2.0-1
:     An open-source HEVC encoder
: community/svt-hevc 1.5.1-2
:     Scalable Video Technology HEVC encoder

#+begin_src bash :results verbatim silent
for package in $(expac -Ss '%D' obs-studio); do
  echo "package: ${package}"
  pacman -Ss "${package}"
  echo 
done
#+end_src

NOT WORKED
#+begin_src bash :results verbatim
svt-hevc
#+end_src
https://superuser.com/questions/1296374/best-settings-for-ffmpeg-with-nvenc

#+begin_src bash :results verbatim
pacman -Ss hevc
# pacman -Ss ffmpeg
#+end_src

#+RESULTS:
: extra/x265 3.5-3 [installed]
:     Open Source H265/HEVC video encoder
: community/hm 17.0-1
:     HEVC Test Model - the reference software for HEVC
: community/kvazaar 2.2.0-1
:     An open-source HEVC encoder
: community/svt-hevc 1.5.1-2 [installed]
:     Scalable Video Technology HEVC encoder

  [2023-05-03 mié]
  [[file:~/Projects/archlinux/desktop/openbox/autostart][file:~/Projects/archlinux/desktop/openbox/autostart]]
** DONE installing AUR obs-studio-browser
https://www.jeremymorgan.com/tutorials/linux/how-to-install-obs-arch-linux/

requirements for obs-studio-browser installation:

#+name: block-1
#+header: :var url="https://aur.archlinux.org/packages/obs-studio-browser"
#+begin_src bash :results verbatim
# ahow url in text and print only lines from pattern 1 to pattern 2
pattern1="^Dependencies"
pattern2="^Required by"
catch_only_
lynx -dump --display_charset=utf-8 "${url}" \
  | sed -n "/${pattern1}/,/${pattern2}/p" \
  | awk '/\* [[]/{ print $2 }' \
  | sed 's/^\[[0-9]*\]//' \
  | head -n -1
#+end_src

#+RESULTS: block-1
#+begin_example
at-spi2-core
ffmpeg-obs
ftl-sdk
gtk-update-icon-cache
jack
libxcomposite
libxrandr
libxss
mbedtls
nss
pciutils
pipewire
qt6-svg
qt6-wayland
rnnoise
vlc-luajit
x264
xdg-desktop-portal
asio
#+end_example

packages no present in system:

#+name: block-2
#+header: :var input=block-1
#+header: :cache yes
#+begin_src bash :results verbatim
input_array=(${input//$'\n'/ })
array_packages_version=$(pacman -Qe)
for package in "${input_array[@]}"; do
  if ! pacman -Ql "${package}" &> /dev/null; then
    echo "${package}"
  fi  
done
#+end_src

#+RESULTS[7995e016e0d853b26b047052fc9841857704f2ad]: block-2
: ffmpeg-obs
: ftl-sdk
: qt6-wayland
: vlc-luajit
: xdg-desktop-portal
: asio

other libraries were required:

#+begin_example bash
error: target not found: ffmpeg-obs>=6
==> ERROR: 'pacman' failed to install missing dependencies.
==> Missing dependencies:
  -> qt6-wayland
  -> ffmpeg-obs>=6
==> Checking buildtime dependencies...
==> Installing missing dependencies...
error: target not found: libajantv2
error: target not found: cef-minimal-obs=103.0.0_5060_shared_textures_143.2591+g4204d54+chromium_103.0.5060.134_1
==> ERROR: 'pacman' failed to install missing dependencies.
==> Missing dependencies:
  -> cmake
  -> libfdk-aac
  -> swig
  -> sndio
  -> asio
  -> nlohmann-json
  -> websocketpp
  -> libajantv2
  -> cef-minimal-obs=103.0.0_5060_shared_textures_143.2591+g4204d54+chromium_103.0.5060.134_1
==> ERROR: Could not resolve all dependencies.

#+end_example

#+header: :dir /sudo::
#+begin_src bash :results verbatim
input=(
  "cmake"
  "libfdk-aac"
  "swig"
  "sndio"
  "asio"
  "nlohmann-json"
  "websocketpp"
  "libajantv2"
  "cef-minimal-obs"
)
bulk_aur(){
  sudo pacman -Syu &> /dev/null || printf "%s\n" "Error updating pacman"
  input=($@)
  for n in "${input[@]}"; do
    printf "%s\n" "${n}"
    if ! sudo pacman -Qe | grep ^"${n}"; then
      if ! sudo pacman -S ^"${n}"$ &> /dev/null; then
	aur "${n}"
      fi
    fi
  done
}
bulk_aur "${input[@]}"
#+end_src

#+RESULTS:
: cmake
: libfdk-aac
: swig
: sndio
: asio
: nlohmann-json
: websocketpp
: libajantv2
: cef-minimal-obs

#+begin_src bash :results verbatim
sudo pacman -R okular
sudo pacman -R purpose
sudo pacman -R kaccounts-integration
sudo pacman -R audacious calibre python-pyqt6-webengine signon-ui
sudo pacman -R audacious-plugins firefox mpv qt5-webengine qt6-webengine vlc-luajit
#+end_src

#+begin_src bash :results verbatim
paro ffmpeg-obs
cef-minimal-obs-bin

#+end_src

#+begin_src bash :results verbatim
    url="https://aur.archlinux.org/${1}.git"
studio/authors/AUTHORS
==> Tidying install...
  -> Removing libtool files...
  -> Purging unwanted files...
  -> Removing static library files...
  -> Stripping unneeded symbols from binaries and libraries...
  -> Compressing man and info pages...
==> Checking for packaging issues...
==> WARNING: Package contains reference to $srcdir
usr/lib/obs-scripting/_obspython.so
usr/lib/obs-scripting/obslua.so
==> Creating package "obs-studio-browser"...
  -> Generating .PKGINFO file...
  -> Generating .BUILDINFO file...
  -> Generating .MTREE file...
  -> Compressing package...
==> Creating package "obs-studio-browser-debug"...
  -> Generating .PKGINFO file...
  -> Generating .BUILDINFO file...
  -> Generating .MTREE file...
  -> Compressing package...
==> Leaving fakeroot environment.
==> Finished making: obs-studio-browser 29.1.0-3 (mar 09 may 2023 18:58:45)
==> Installing package obs-studio-browser with pacman -U...
[sudo] password for angel: 
loading packages...
resolving dependencies...
looking for conflicting packages...

Packages (2) obs-studio-browser-29.1.0-3  obs-studio-browser-debug-29.1.0-3

Total Installed Size:  521,37 MiB

:: Proceed with installation? [Y/n] 
(2/2) checking keys in keyring                     [######################] 100%
(2/2) checking package integrity                   [######################] 100%
(2/2) loading package files                        [######################] 100%
(2/2) checking for file conflicts                  [######################] 100%
(2/2) checking available disk space                [######################] 100%
:: Processing package changes...
(1/2) installing obs-studio-browser                [######################] 100%
Optional dependencies for obs-studio-browser
    libfdk-aac: FDK AAC codec support [installed]
    intel-media-driver: Hardware encoding (>= Broadwell)
    libva-intel-driver: Hardware encoding (<= Haswell)
    libva-mesa-driver: Hardware encoding
    swig: Scripting [installed]
    luajit: Lua scripting [installed]
    python>=3.11: Python scripting [installed]
    sndio: Sndio input client [installed]
    v4l2loopback-dkms: Virtual camera output
    libajantv2: AJA NTV 2 support [installed]
    decklink: Blackmagic Design DeckLink support
(2/2) installing obs-studio-browser-debug          [######################] 100%
:: Running post-transaction hooks...
(1/3) Arming ConditionNeedsUpdate...
(2/3) Updating icon theme caches...
(3/3) Updating the desktop file MIME type cache...
==> Cleaning up...

#+end_src

  [2023-05-09 mar]
  [[file:~/Projects/archlinux/desktop/openbox/autostart::third=$(((screen_width / 3) - ${width_border_left:-1} - ${width_border_right:-1}))]]

** DONE pacman

: list installed packages and version

#+begin_src bash :results verbatim silent
pacman -Qe
#+end_src

: list packages available for upgrade

#+header: :dir /sudo::
#+begin_src bash :results verbatim
pacman -Sy && echo && pacman -Qu
#+end_src

#+RESULTS:
: :: Synchronising package databases...
:  core
:  core is up to date extra
:  extra is up to date community
:  community is up to date
: libopenmpt 0.7.0-1 -> 0.7.1-1
: luajit 2.1.0.beta3.r471.g505e2c03-1 -> 2.1.0.beta3.r471.g224129a8-1

: paru
# a package installer for AUR packages
# the author has interesting projects in rust, and uses toml and yaml
https://github.com/Morganamilo
https://toml.io/en/
https://www.redhat.com/en/topics/automation/what-is-yaml
https://www.redhat.com/sysadmin/yaml-beginners
# example runing shell commands in yaml
https://github.com/Morganamilo/paru/blob/master/.github/workflows/paru.yml
  [2023-05-09 mar]
** TODO ask for sudo password at the beginning of a script
#+begin_example bash
sudo -v
#+end_example

explainning:
There is also a practice of putting "sudo -v" at the start of any such script, then "sudo" before just the commands that require root access.  This kind of gets the best of both worlds.  The initial "sudo -v" ensures that the user running is a valid sudo user (they are prompted for the password right at the start).  From them on further sudo commands may not need a password if the timeout hasn't expired - but only those commands that have sudo infront of them are actually ran as root.

#+begin_src bash :results verbatim
man sudo | grep '\-v'
#+end_src

#+RESULTS:
:      sudo -v [-ABkNnS] [-g group] [-h host] [-p prompt] [-u user]
:      sudoers(5) for more information.  By running sudo with the -v option, a
:      -V, --version
:      -v, --validate

source: https://bbs.archlinux.org/viewtopic.php?pid=1741553#p1741553
  [2023-05-13 sáb]
** TODO Linux SD card/SDIO driver development 0-basic knowledge
SD cards are classified according to the bus speed mode, there are the following types:

Default Speed ​​mode: 3.3V power supply mode, frequency upper limit 25MHz, speed upper limit 12.5MB/sec
 High Speed ​​mode: 3.3V power supply mode, frequency upper limit 50MHz, speed upper limit 25MB/sec
 SDR12: UHS-I card, 1.8V power supply mode, frequency upper limit 25MHz, speed upper limit 12.5MB/sec
 SDR25: UHS-I card, 1.8V power supply mode, frequency upper limit 50MHz, speed upper limit 25MB/sec
 SDR50: UHS-I card, 1.8V power supply mode, frequency upper limit 100MHz, speed upper limit 50MB/sec
 SDR104: UHS-I card, 1.8V power supply mode, frequency upper limit 208MHz, speed upper limit 104MB/sec
 DDR50: UHS-I card, 1.8V power supply mode, frequency upper limit 50MHz, performance upper limit 50MB/sec
UHS156： UHS-II RCLK Frequency Range 26MHz - 52MHz, up to 1.56Gbps per lane.

source: https://www.programmersought.com/article/40256125396/

If you have enough RAM free, you can run /tmp from RAM
source: https://unix.stackexchange.com/questions/386255/improve-sd-card-write-speed

real sdcard spped
#+header: :dir /sudo::
#+header: :results verbatim
#+begin_src bash
sudo dmesg | grep mmc
#+end_src

#+RESULTS:
: [    1.343618] mmc0: cannot verify signal voltage switch
: [    1.499757] mmc0: new ultra high speed SDR104 SDHC card at address 0001
: [    1.503980] mmcblk0: mmc0:0001 SD32G 29.1 GiB 
: [    1.505022]  mmcblk0: p1
: [   12.518650] FAT-fs (mmcblk0p1): Volume was not properly unmounted. Some data may be corrupt. Please run fsck.

  [2023-05-13 sáb]
  [[file:~/Documents/org/notes.org::*test drive speed read][test drive speed read]]
